{"modelTopology": {"keras_version": "2.1.6-tf", "model_config": {"config": [{"config": {"return_state": false, "reset_after": false, "trainable": true, "recurrent_regularizer": null, "batch_input_shape": [32, null, 98], "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "implementation": 1, "kernel_regularizer": null, "dropout": 0.25, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "name": "gru", "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "activation": "tanh", "unroll": false, "return_sequences": true, "units": 64, "dtype": "float32", "bias_regularizer": null, "stateful": true}, "class_name": "GRU"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "name": "dense", "use_bias": true, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "units": 98, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation", "trainable": true, "dtype": "float32"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"metrics": ["acc"], "sample_weight_mode": null, "loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"config": {"amsgrad": false, "decay": 9.999999747378752e-06, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-07}, "class_name": "Adam"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense/kernel", "shape": [64, 98], "dtype": "float32"}, {"name": "dense/bias", "shape": [98], "dtype": "float32"}, {"name": "gru/kernel", "shape": [98, 192], "dtype": "float32"}, {"name": "gru/recurrent_kernel", "shape": [64, 192], "dtype": "float32"}, {"name": "gru/bias", "shape": [192], "dtype": "float32"}]}]}